{
  "currentPage": 1,
  "totalPages": 58,
  "data": [
{"postId": 292, "date": 1484862054, "title": "Hat Thief", "content": "<p>It’s very rare for me to look at one of my completed artworks and be impressed by it. I usually spend most of my time noticing all the errors I made during drawing or editing, or trying not to look at the bits I’m least proud of.</p>\n<p>This one, however, is different.</p>\n<p style=\"text-align: center;\"><a href=\"/art/view/484\"><img class=\"posted\" src=\"/art/images/hat_thief.jpg\" alt=\"\" /></a></p>\n<p>I know I say this with every artwork I post about in this journal, but this is by far my most impressive artwork to date—and it’s one of a very small handful of images I can actually step back to look at and enjoy.</p>\n<p>I’m still somewhat impressed I drew it, especially after taking quite an extended Christmas break. Usually if I take a break, the quality of the pictures I draw immediately afterwards are variable and it takes me a while to get back up to speed. This picture appears to have broken that trend somewhat.</p>\n<p>I actually don’t have much to say about this picture in comparison to the others I’ve drawn 😊 . I’d recently finished playing Pokémon Sun and these two characters were my favourite in the game, driving the storyline and a fair few emotional moments—especially closer to the end. I decided to pay tribute to both of them without giving away too many clues to the storyline and after a while the picture started to take this form.</p>\n<p>Only downside to this picture is that I’ve now set the bar really high for all future works to be compared to. I’m going to have to try really hard to get the next image I draw to look—and feel—anywhere near as good!</p>", "tags": ["art"]},
{"postId": 291, "date": 1483191228, "title": "The 2016 retrospective", "content": "<p>It’s the end of December. To those of you new to my works, hello! To those of you who’ve known me for a while, thank you for being a source of light and happiness in a year that was at times dark and melancholic. I hope I’ve been able to be a similar source for you. Hopefully you’ve all had a decent year and are moving into 2017 on a positive note.</p>\n<p>As with <a href=\"/journal/post/276\">last year</a>, I’m taking this opportunity to look back upon all that I’ve achieved over the past twelve months. I won’t go into monthly detail on what I’ve done this year: so much has happened, and besides, the beginning of 2016 feels so long ago now that I honestly cannot accurately remember what I was doing for the first part of the year.</p>\n<p>The most significant change for me this year was back in April when I was moved to the web apps team due to budget cuts at the company I am working at. This has allowed me to use my more artistic side in my daily job with the knock-on side effect of reducing my motivation to do any work on my personal artistic projects in my free time. The team has struggled to work on getting a product out the door before the end of the year whilst staying within budget–and, to be completely honest with you, for most of the year it didn’t seem as if we would make it. Fortunately, in the fortnight leading up to Christmas, things <em>finally</em> started coming together.</p>\n<p>I’ve come a long way over the course of the year. Despite changes and stress from work, I’ve continued to improve myself and my non-work skill set. In 2015 I was able to improve my outlook after a few years down in the dumps, and I’ve definitely done my best to continue in that direction through 2016. I’ve also managed to finish the year with quite a significant positive bank balance in my everyday account (even after getting presents and the like for Christmas) which, while unexpected at first, is definite proof that my finances are in a much better shape this year than they have been.</p>\n<p>At the beginning of the year, I challenged myself to complete at least twelve artworks, limiting the work on every image to a month. I tried my best to keep to this schedule, drawing a vector character image for eleven months. June was a no-show as I didn’t finish in time due to work deadlines and then going on holiday. I’ve been told the quality of my art has improved over the year, and I find that’s reflected when you compare the images side-by-side.</p>\n<p style=\"text-align: center;\"><a href=\"/art/view/483\"><img class=\"posted\" src=\"/art/images/yearly-art-wheel-2016.jpg\" alt=\"\" /></a></p>\n<p>Most of these images have a long tale accompanying them depicting what I like best and what I learnt while drawing them: I’ll let you read those in your spare time by viewing the full-sized images in the <a href=\"http://jbrowne.me.uk/art/album/calendar2016\">2016 calendar gallery</a>. As a summary, I’ve spent a lot of time focussing on lighting and realistic shapes leading to what I think are some of my best works to date.</p>\n<p>I’ve picked up a few new skills this year, most of which are work-related. A few of them have spilt over to my hobbies: this website being a prime example. I rewrote the ageing PHP-based website in May, and then dropped that completely in favour of a faster Angular 2.0 site in November. If most of those words didn’t make sense to you, that’s fine: I basically advanced the site’s code about ten years by using more modern technologies.</p>\n<p>2017 looks like it’s going to be an interesting year. I can’t even hazard a guess as to what’s going to happen this coming year. My office is moving to Didcot as I write this, that’s about a fifteen minute drive from my flat. It’s amusing that this is one of the few years in my life where I haven’t moved where I live, but where I work instead. As I <a href=\"/journal/post/276\">correctly estimated</a> last year, I wasn’t able to complete my three-year training course in 2016, but I’m in a far better position to do so in 2017.</p>\n<p>The world also seems in an odd shape starting out the New Year. With Brexit on the horizon and a new American president looming, there’s definitely going to be some change from what we’re used to. But time is a gift and the present is truly a present–so whatever happens, we should try and make the most of it.</p>", "tags": ["retrospective"]},
{"postId": 290, "date": 1476872943, "title": "The journey", "content": "<p>It’s been a few weeks since I completed my artwork for September, The Journey. I know at the time I said I’d write a journal post about how I’d put it all together, but with pressure at work and a tough time at home I let this slip somewhat. I have, however, wanted to write this and have made a few notes here and there which I think I can cobble together as a coherent journal post now.</p>\n<p style=\"text-align: center;\"><a href=\"/art/view/478\"><img class=\"posted\" src=\"/art/images/trainride-f02.jpg\" alt=\"\" /></a></p>\n<p>The Journey is one of those pieces I’ve truly gone out of my way to make something special. When I started it I didn’t intend for it to end up as epic as it did, it’s only after I’d restarted the image twice and spent a significant amount of time on it that I realised I wanted it to stand out and be something special. In total, I spent about 3 hours a day for 21 days working on it, and I’m very happy indeed with the way it’s turned out.</p>\n<p>When I started, the image was supposed to be a &ldquo;cutesy&rdquo; image of a boy and a girl on a couch in the afternoon sunlight&mdash;as a matter of fact, the file name is &ldquo;couch.svg&rdquo; which is somewhat telling. Of course, they couldn’t just be sitting down: that would be too boring. I experimented with making them do things like reading or playing video games together, but nothing really stood out as interesting. I also toyed with them sitting at opposite ends as if they’d just had an argument, but the image started to lose its appeal when I did that.</p>\n<p>After a few &ldquo;ideations&rdquo; on this design, I decided it would be a more touching image if the couple were being a bit more intimate&mdash;but after August’s image, I didn’t want to get too intimate. It was therefore a pretty obvious choice to have them asleep on each other’s shoulders, which led to the pose that you see in the final image. The location changed quite a few times in the first &ldquo;sketches&rdquo; (if that’s what you call the scratchy lines I drew in Inkscape) before I settled on the train carriage.</p>\n<p>Train journeys have been one of those things that I’ve been doing for a large portion of my life. I’m one of those people who will end up taking a metro over equivalent transportation&mdash;I feel at home on the London Underground or the Singapore MRT, for instance. Placing the scene in a train carriage just reverberated with me and that was the reason why I could shamelessly slot myself into this picture along with &ldquo;best girl lel&rdquo;.</p>\n<p>The carriage itself draws on inspiration from my time in Asia. Here in the UK, train carriages generally tend to have seats facing the front and back of the carriage, so you face the direction the train is going, or find yourself moving backwards. However, in countries like Singapore and Japan, the train seats in their commuter trains tend to be along the sides of the carriage. I think the decision of drawing the train this way is probably because I wanted to show scenery in the background. Since it’s been a year since my trip to Japan, I decided that it would be nice to commemorate it by drawing a train in the style of a Tokyo or Kyoto commuter train.</p>\n<p>I’ll admit I didn’t think much about the backdrop outside the train carriage to start with. I drew a very simple backdrop at first: some trees and basic, uncoloured telegraph pylons and released a &ldquo;work in progress&rdquo; to my friends, who instantly commented that the overall picture had a distinct Japanese flair to it. Since I was already pulling ideas from my time in Asia, it wasn’t hard to take inspiration for the scenery from there too. The scenery is actually more based off the area of Thailand where my mother was born: the telegraph pole streetlamps I’ve drawn are actually based on streetlamps around my parents’ house.</p>\n<p>I know I’ve been concentrating on Paige a lot recently in terms of characters used. I’ve not hidden the fact that she’s my idea of &ldquo;the perfect girl&rdquo; and I guess I have been a bit obsessed with getting her looking <em>right</em> over the course of this last year. In the original Sandy Saturday comics, I hinted at her being close to my character. In the Reboot, I hinted at that no longer being the case. I’ve never actually confirmed this connection, so I guess you can now take this as the <em>official</em> canon version of events that there’s a connection there. That said, I am going to shift the focus off her for a bit: it’s getting a little repetitive drawing her every time and I’m pretty sure she’s a bit sick of the limelight right now 😉</p>\n<p>The rest is the same story as usual. I’ve concentrated a lot on lighting in this picture, and I think it’s paid off. Admittedly I haven’t mixed the lighting from inside and outside the carriage, so the afternoon sun isn’t casting shadows, but I’ve tried to make everything inside the carriage appear lit from the ceiling lighting. I also put more emphasis on lighting on clothes, which is something I’ve already started using in October’s image. I also brought forward some of the new learning I picked up in previous months&mdash;most notably the lighting on faces and hair, and some smaller things like Paige’s fringes being semi-transparent where the hair is thinner.</p>\n<p>There are parts that I’m not entirely happy with. For example, I’m still trying to get clouds looking decent&mdash;the current style I’m using is slightly too hard-edged. Also, the more I look at it, the more I’m starting to think the scenery is a little too small and may have been better if it filled more of the window. Fortunately, most of the annoyances are minor and don’t detract too much from the overall composition.</p>\n<p>I’ve already completed October’s image at time of writing this&mdash;and it’s already used a lot of the things I’ve learnt from The Journey, even though it’s a significantly more simple image than this one. As always, it’s a learning process and is definitely helping me improve overall.</p>", "tags": ["art", "calendar"]}
  ]
}
